unload/cf/Reports/кб99_ОстаткиПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Report>
		<Properties>
			<Name>кб99_ОстаткиПартий</Name>
		</Properties>
	</Report>
</MetaDataObject>

unload/cf/AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

unload/cf/InformationRegisters/кб99_ОстаткиПартийВетис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>кб99_ОстаткиПартийВетис</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Партия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

unload/cf/Catalogs/ВСД_Площадка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВСД_Площадка</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuidХозСубъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлощадки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Страна</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Регион</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Район</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Город</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_НаселенныеПункты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Улица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДома</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарамКолонкаСортировкиПартииСписания</Name>
					<Comment>Сортировка Актуальных Партий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарамЗнакСортировкиУбывание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерсональныеПараметрыСписанияПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальностиПартий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьПриГрупповомГашении</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусРегистрации</Name>
					<Comment>Статус предприятия в реестре ИС Цербер.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.кб99_СтатусПлощадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

unload/cf/Reports/кб99_ОстаткиПартий/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	кб99_ВСД_Общий.ПроверитьВозможностьИспользованияОтчета();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ТабДок = СформироватьОтчетНаСервере();
	
	ПараметрыОткрытияФормы = Новый Структура("ТабДок", ТабДок);
	ОткрытьФорму("Отчет.кб99_ОстаткиПартий.Форма.ФормаТабличногоДокумента", ПараметрыОткрытияФормы);
	//ТабДок.ОтображатьСетку = Ложь;
	////ТабДок.Автомасштаб = Истина;
	//ТабДок.ОтображатьЗаголовки = Ложь;	
	//ТабДок.Показать("Заявка поставщику");  
	
КонецПроцедуры 

&НаСервере
Функция СформироватьОтчетНаСервере()
	
	ТабДок = Новый ТабличныйДокумент;
	Обработка =  РеквизитФормыВЗначение("Объект");
	Макет = Обработка.ПолучитьМакет("МакетОтчета");
	
	ОбластьЗаголовок	  = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы1с = Макет.ПолучитьОбласть("ШапкаТаблицыОстатки1с");
	ОбластьСклад		  = Макет.ПолучитьОбласть("Склад");
	ОбластьНоменклатура1с = Макет.ПолучитьОбласть("стрТовары1с");
	ОбластьИтог1с		  = Макет.ПолучитьОбласть("Итог1с");
	
	ОбластьЗаголовок.Параметры.ВыбПродукцияЭлемент = выбПродукцияЭлемент.Наименование;
	ОбластьЗаголовок.Параметры.ВыбПлощадка		   = выбПлощадка;
	ОбластьЗаголовок.Параметры.ВыбДата			   = Формат(выбДата, "ДЛФ=D");
	ТабДок.Вывести(ОбластьЗаголовок);
	
	ТабДок.Вывести(ОбластьШапкаТаблицы1с);

	ТабДок.НачатьАвтогруппировкуСтрок();
		
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток КАК ОстатокШт,
		|	ТоварыНаСкладахОстатки.ВНаличииОстаток * ТоварыНаСкладахОстатки.Номенклатура.ВесЧислитель / ТоварыНаСкладахОстатки.Номенклатура.ВесЗнаменатель КАК ОстатокВес
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
		|			&Дата,
		|			Склад В
		|					(ВЫБРАТЬ
		|						ВСД_ПлощадкаСклады.Склад КАК Склад
		|					ИЗ
		|						Справочник.ВСД_Площадка.Склады КАК ВСД_ПлощадкаСклады
		|					ГДЕ
		|						ВСД_ПлощадкаСклады.Ссылка = &выбПлощадка)
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВСД_Соответсвия.Владелец КАК Номенклатура
		|					ИЗ
		|						Справочник.ВСД_Соответсвия КАК ВСД_Соответсвия
		|					ГДЕ
		|						ВСД_Соответсвия.ПродукцияЭлемент = &выбПродукцияЭлемент)) КАК ТоварыНаСкладахОстатки
		|ИТОГИ
		|	СУММА(ОстатокШт),
		|	СУММА(ОстатокВес)
		|ПО
		|	Склад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	кб99_ОстаткиПартийВетисСрезПоследних.Партия.Продукция_Элемент КАК Продукция_Элемент,
		|	кб99_ОстаткиПартийВетисСрезПоследних.Партия.ДатаИзготовления1 КАК ДатаИзготовления,
		|	кб99_ОстаткиПартийВетисСрезПоследних.Партия.ДатаСрокГодности1 КАК СрокГодности,
		|	кб99_ОстаткиПартийВетисСрезПоследних.Партия КАК Партия,
		|	кб99_ОстаткиПартийВетисСрезПоследних.Количество КАК Остаток
		|ИЗ
		|	РегистрСведений.кб99_ОстаткиПартийВетис.СрезПоследних(
		|			&Дата,
		|			Партия.Получатель_Площадка = &выбПлощадка
		|				И Партия.Продукция_Элемент = &выбПродукцияЭлемент) КАК кб99_ОстаткиПартийВетисСрезПоследних
		|ГДЕ
		|	кб99_ОстаткиПартийВетисСрезПоследних.Партия.Получатель_Площадка = &выбПлощадка
		|ИТОГИ
		|	СУММА(Количество)
		|ПО
		|	Продукция_Элемент";		
	Запрос.УстановитьПараметр("Дата", КонецДня(выбДата));
	Запрос.УстановитьПараметр("выбПлощадка", выбПлощадка);
	Запрос.УстановитьПараметр("выбПродукцияЭлемент", выбПродукцияЭлемент);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПоСкладам = РезультатЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Итог1сШт  = 0;
	Итог1сВес = 0;
	
	Пока ВыборкаПоСкладам.Следующий() Цикл
		
		ОбластьСклад.Параметры.Заполнить(ВыборкаПоСкладам);
		ТабДок.Вывести(ОбластьСклад, 1); 
		
		Итог1сВес = Итог1сВес + ВыборкаПоСкладам.ОстатокВес;
		Итог1сШт  = Итог1сШт  + ВыборкаПоСкладам.ОстатокШт;
		
		ВыборкаОстатки = ВыборкаПоСкладам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОстатки.Следующий() Цикл
			
			ОбластьНоменклатура1с.Параметры.Заполнить(ВыборкаОстатки);
			ТабДок.Вывести(ОбластьНоменклатура1с, 2); 
			
		КонецЦикла;
		
	КонецЦикла;	
	
	ОбластьИтог1с.Параметры.Итог1сШт  = Итог1сШт;
	ОбластьИтог1с.Параметры.Итог1сВес = Итог1сВес;
	ТабДок.Вывести(ОбластьИтог1с, 1); 
	
	#Область ВыводостатковПоМеркурию
	
	ОбластьШапкаТаблицыОстаткиМерк	 = Макет.ПолучитьОбласть("ШапкаТаблицыОстаткиМерк");
	ОбластьСтрПродукция				 = Макет.ПолучитьОбласть("стрПродукция");
	ОбластьСтрПартия				 = Макет.ПолучитьОбласть("стрПартия");
	ОбластьИтогПоПартиям	         = Макет.ПолучитьОбласть("ИтогПоПартиям");
	
	ТабДок.Вывести(ОбластьШапкаТаблицыОстаткиМерк);
	
	ВыборкаПоПродукции = РезультатЗапроса[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ИтогПоПартиям = 0;
	
	Пока ВыборкаПоПродукции.Следующий() Цикл
		
		ОбластьСтрПродукция.Параметры.Заполнить(ВыборкаПоПродукции);
		ТабДок.Вывести(ОбластьСтрПродукция, 1); 
		
		ИтогПоПартиям = ИтогПоПартиям + ВыборкаПоПродукции.Остаток; 
		
		ВыборкаПартии = ВыборкаПоПродукции.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПартии.Следующий() Цикл
			
			ОбластьСтрПартия.Параметры.Заполнить(ВыборкаПартии);
			ОбластьСтрПартия.Параметры.ДатаИзготовления = Формат(кб99_ВСД_Запросы.СтрокаВДату(ВыборкаПартии.ДатаИзготовления), "ДЛФ=D");
			ОбластьСтрПартия.Параметры.СрокГодности = Формат(кб99_ВСД_Запросы.СтрокаВДату(ВыборкаПартии.СрокГодности), "ДЛФ=D");
			
			СтруктураРасшифровки = Новый Структура;
			СтруктураРасшифровки.Вставить("Партия", ВыборкаПартии.Партия);
            ОбластьСтрПартия.Параметры.РасшифровкаПартии = СтруктураРасшифровки;
			
			ТабДок.Вывести(ОбластьСтрПартия, 2); 
			
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьИтогПоПартиям.Параметры.ИтогПоПартиям = ИтогПоПартиям;
	ТабДок.Вывести(ОбластьИтогПоПартиям, 1);
	
	#КонецОбласти
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.ПоказатьУровеньГруппировокСтрок(0);
	
	Возврат ТабДок;
	
КонецФункции
